# a*x**2 + b*x + c = 0

a = int(input("Введите первый коэффициент(а): "))
b = int(input("Введите второй коэффициент(b): "))
c = int(input("Введите третий коэффициент(c): "))

if a == 0:
    x_lin = -c / b
    print("Это линейное уравнение! х равен: ", x_lin)
else:
    D = b**2 - 4*a*c
    x_one = (-b + pow(D, .5))/(2*a)
    x_two = (-b - pow(D, .5))/(2*a)
    print("Дискриминант равен: ", D)
    if D > 0:
        print("Корень №1 равен: ", x_one)
        print("Корень №2 равен: ", x_two)
    elif D == 0:
        print("Корень №1 равен: ", x_one)
    else:
        print("Уравнение корней не имеет")
